Revit 2024 API
SphericalLightDistribution Class
 This class encapsulates a spherical light distribution.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class SphericalLightDistribution : LightDistribution
Visual Basic
Public Class SphericalLightDistribution _
	Inherits LightDistribution
Visual C++
public ref class SphericalLightDistribution : public LightDistribution
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.LightDistribution
 Autodesk.Revit.DB.Lighting.SphericalLightDistribution
See Also
SphericalLightDistribution Members
Autodesk.Revit.DB.Lighting Namespace